app/views/comments/_comment.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]
---
<br><br>
<p><strong>by - <%= User.find(comment.user_id).email %></strong></p>