app/views/home/profile.html.erb

SELECT "follow_mappings"."follower_id" FROM "follow_mappings" WHERE "follow_mappings"."followee_id" = ?  [["followee_id", 9]]
---
Followers:
<%= FollowMapping.where(followee_id: @user.id).pluck(:follower_id).length %> <br>