app/views/home/users.html.erb

              <div class="followers">Followers:
                <span> <%= FollowMapping.where(followee_id: user.id).pluck(:follower_id).length %></span></div>
---
SELECT "follow_mappings"."follower_id" FROM "follow_mappings" WHERE "follow_mappings"."followee_id" = ?  [["followee_id", 8]]