app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "add"], ["post_id", 9], ["user_id", 9], ["created_at", "2017-07-10 09:16:38.486577"], ["updated_at", "2017-07-10 09:16:38.486577"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(params[:comment].permit(:content))
    @comment.user_id = current_user.id
    @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 9]]
---
  def upvote
    @comment = Comment.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 9]]
---
  def downvote
    @comment = Comment.find(params[:id])