app/controllers/home_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 9]]
---
  def profile
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 9]]
INSERT INTO "follow_mappings" ("followee_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["followee_id", 8], ["follower_id", 9], ["created_at", "2017-07-20 10:37:52.731847"], ["updated_at", "2017-07-20 10:37:52.731847"]]
---
  def follow
    @followee_id = params[:followee_id]
    # byebug
    if params[:post]
      @post=Post.find(params[:post].to_i)
    else
      @user = User.find(params[:followee_id])
    end
    if current_user.can_follow @followee_id
    FollowMapping.create(:followee_id => @followee_id, :follower_id => current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 9]]
DELETE FROM "follow_mappings" WHERE "follow_mappings"."id" = ?  [["id", 3]]
SELECT  "follow_mappings".* FROM "follow_mappings" WHERE "follow_mappings"."followee_id" = ? AND "follow_mappings"."follower_id" = ?  ORDER BY "follow_mappings"."id" ASC LIMIT 1  [["followee_id", 10], ["follower_id", 9]]
---
  def unfollow
    @followee_id = params[:followee_id]
    if params[:post]
      @post=Post.find(params[:post].to_i)
    else
      @user = User.find(params[:followee_id])
    end
    if current_user.can_unfollow @followee_id
      FollowMapping.where(:followee_id => @followee_id, :follower_id => current_user.id).first.destroy