app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order('created_at DESC')
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "this is from aakash"], ["body", "nothing new.."], ["user_id", 3], ["created_at", "2017-07-08 18:33:24.062739"], ["updated_at", "2017-07-08 18:33:24.062739"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "nothing new.."], ["updated_at", "2017-07-08 13:40:29.035691"], ["id", 1]]